18-rails-session/app/controllers/application_controller.rb

SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show_cart
    # GETTING ALL THE ITEMS

    @cart_nachos = Nacho.find(cart)